app/Views/teacher/classes.php

SELECT *
FROM `courses`
---
        <?php
        // For now, we'll get all courses. In a real implementation, you'd filter by teacher
        $courseModel = new \App\Models\CourseModel();
        $courses = $courseModel->findAll();