app/Views/auth/dashboard.php

        <!-- Recent Announcements Section -->
        <?php
        $announcementModel = new \App\Models\AnnouncementModel();
        $recentAnnouncements = $announcementModel->orderBy('created_at', 'DESC')->limit(3)->findAll();
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
 LIMIT 3

        <!-- Recent Announcements Section -->
        <?php
        $announcementModel = new \App\Models\AnnouncementModel();
        $recentAnnouncements = $announcementModel->orderBy('created_at', 'DESC')->limit(3)->findAll();
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
 LIMIT 3