app/Controllers/Admin.php

SELECT *
FROM `users`
---
    public function manageUsers()
    {
        // Role-based access control is handled by the RoleAuth filter
        $userModel = new \App\Models\UserModel();
        // Include soft-deleted users so admin can see deleted records
        $users = $userModel->withDeleted()->findAll();

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 8
---
    public function editUser($id = null)
    {
        $id = (int) $id;
        if ($id <= 0) {
            return redirect()->to('/admin/manage-users')->with('error', 'Invalid user ID');
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($id);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 11
---
    public function updateUser($id = null)
    {
        $id = (int) $id;
        if ($id <= 0) {
            return redirect()->to('/admin/manage-users')->with('error', 'Invalid user ID');
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($id);