app/Controllers/Announcement.php

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
    public function index()
    {
        // Fetch all announcements ordered by created_at in descending order (newest first)
        $data['announcements'] = $this->announcementModel->orderBy('created_at', 'DESC')->findAll();