app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);
        $session = session();

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];

            if ($this->validate($rules)) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');

                try {
                    $model = new UserModel();

                    // Find user by email only
                    $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'teacher1@example.com'
 LIMIT 1