app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'canitanjasper016@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        // If already logged in
        if (session()->get('isAuthenticated')) {
            return redirect()->to('/dashboard');
        }

        // Handle POST (form submit)
        if ($this->request->getMethod() === 'POST') {
            $userEmail = $this->request->getPost('email');
            $userPassword = $this->request->getPost('password');

            if (empty($userEmail) || empty($userPassword)) {
                return redirect()->back()->with('login_error', 'Please provide both email and password.');
            }

            $userModel = new UserModel();
            $userRecord = $userModel->where('email', $userEmail)->first();

SELECT *
FROM `users`
WHERE `email` = 'student1@example.com'
 LIMIT 1
---
    public function register()
    {
        if (session()->get('isAuthenticated')) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            $fullName       = trim((string) $this->request->getPost('name'));
            $emailAddress   = trim((string) $this->request->getPost('email'));
            $newPassword    = (string) $this->request->getPost('password');
            $confirmPassword = (string) $this->request->getPost('password_confirm');

            if ($fullName === '' || $emailAddress === '' || $newPassword === '' || $confirmPassword === '') {
                return redirect()->back()->withInput()->with('register_error', 'All fields must be completed.');
            }

            if (!filter_var($emailAddress, FILTER_VALIDATE_EMAIL)) {
                return redirect()->back()->withInput()->with('register_error', 'Please enter a valid email address.');
            }

            if ($newPassword !== $confirmPassword) {
                return redirect()->back()->withInput()->with('register_error', 'Passwords do not match.');
            }

            $userModel = new UserModel();

            if ($userModel->where('email', $emailAddress)->first()) {

SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT COUNT(*) AS `numrows` FROM `enrollments`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT `enrollments`.*, `users`.`name` as `student_name`, `courses`.`course_name`
FROM `enrollments`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
LEFT JOIN `courses` ON `courses`.`course_id` = `enrollments`.`course_id`
ORDER BY `enrollments`.`enrollment_date` DESC
 LIMIT 5
---
                $enrollmentModel = new \App\Models\EnrollmentModel();

                // Admin dashboard data
                $data['users'] = $userModel->findAll();
                $data['totalUsers'] = count($data['users']);
                $data['totalCourses'] = $courseModel->countAll();
                $data['totalEnrollments'] = $enrollmentModel->countAll();

                // Get user statistics by role
                $data['adminCount'] = $userModel->where('role', 'admin')->countAllResults();
                $data['teacherCount'] = $userModel->where('role', 'teacher')->countAllResults();
                $data['studentCount'] = $userModel->where('role', 'student')->countAllResults();

                // Recent enrollments
                $data['recentEnrollments'] = $enrollmentModel->select('enrollments.*, users.name as student_name, courses.course_name')
                    ->join('users', 'users.id = enrollments.user_id', 'left')
                    ->join('courses', 'courses.course_id = enrollments.course_id', 'left')
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->limit(5)
                    ->findAll();

SELECT `enrollments`.*, `courses`.`course_name`, `courses`.`course_code`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`course_id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '6'
ORDER BY `enrollments`.`enrollment_date` DESC
 LIMIT 3
---
                }

                // Get recent activity (enrollments)
                $data['recentActivity'] = $enrollmentModel->select('enrollments.*, courses.course_name, courses.course_code')
                    ->join('courses', 'courses.course_id = enrollments.course_id', 'left')
                    ->where('enrollments.user_id', $userId)
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->limit(3)
                    ->findAll();