app/Controllers/Materials.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function upload($course_id)
    {
        log_message('info', 'Upload method called for course ID: ' . $course_id . ', Method: ' . $this->request->getMethod());

        // Check if user is admin/instructor
        $userRole = session()->get('role');
        $isLoggedIn = session()->get('isLoggedIn');
        log_message('info', 'User role: ' . ($userRole ?: 'null') . ', Is logged in: ' . ($isLoggedIn ? 'yes' : 'no'));

        if (!$isLoggedIn) {
            log_message('info', 'User not logged in, redirecting to login');
            return redirect()->to('/login')->with('error', 'Please login to upload materials.');
        }

        if ($userRole !== 'admin' && $userRole !== 'teacher') {
            log_message('info', 'Access denied - user role: ' . $userRole);
            return redirect()->to('/')->with('error', 'Access denied. Admin privileges required.');
        }

        // Get course information
        $course = $this->courseModel->find($course_id);

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
SELECT *
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '1'
 LIMIT 1
---
    public function courseMaterials($course_id)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please login to view materials.');
        }

        // Get course information
        $course = $this->courseModel->find($course_id);
        if (!$course) {
            return redirect()->to('/dashboard')->with('error', 'Course not found.');
        }

        // Check if user is enrolled in the course
        $userId = session()->get('user_id');
        $isEnrolled = $this->enrollmentModel->where('user_id', $userId)
                                          ->where('course_id', $course_id)
                                          ->first();