app/Models/AssignmentModel.php

    public function getAssignmentsByTeacher($teacherId)
    {
        return $this->where('teacher_id', $teacherId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `assignments`
WHERE `teacher_id` = '3'
AND `assignments`.`deleted_at` IS NULL
ORDER BY `created_at` DESC