app/Models/CourseModel.php

SELECT *
FROM `courses`
ORDER BY `course_name` ASC
---
    public function getAllCourses()
    {
        return $this->orderBy('course_name', 'ASC')->findAll();

SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '5'
---
    public function getCourseById($course_id)
    {
        return $this->find($course_id);

SELECT *
FROM `courses`
WHERE `teacher_id` = '3'
ORDER BY `course_name` ASC
---
    public function getCoursesByTeacher($teacher_id)
    {
        return $this->where('teacher_id', $teacher_id)
                    ->orderBy('course_name', 'ASC')
                    ->findAll();

SELECT `enrollments`.*, `courses`.`course_name`, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `courses`
LEFT JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '3'
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getTeacherCourseEnrollments($teacher_id)
    {
        return $this->select('enrollments.*, courses.course_name, users.name as student_name, users.email as student_email')
                    ->join('enrollments', 'enrollments.course_id = courses.course_id', 'left')
                    ->join('users', 'users.id = enrollments.user_id', 'left')
                    ->where('courses.teacher_id', $teacher_id)
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();