app/Models/CourseModel.php

SELECT `enrollments`.*, `courses`.`course_name`, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `courses`
LEFT JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '3'
AND `enrollments`.`status` = 'approved'
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getTeacherCourseEnrollments($teacher_id)
    {
        return $this->select('enrollments.*, courses.course_name, users.name as student_name, users.email as student_email')
                    ->join('enrollments', 'enrollments.course_id = courses.course_id', 'left')
                    ->join('users', 'users.id = enrollments.user_id', 'left')
                    ->where('courses.teacher_id', $teacher_id)
                    ->where('enrollments.status', 'approved')
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();