app/Models/EnrollmentModel.php

SELECT `enrollments`.*, `courses`.`course_name`, `courses`.`description`, `courses`.`course_code`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`course_id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '6'
AND `enrollments`.`status` IN ('approved')
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getUserEnrollments($user_id, array $statuses = ['approved'])
    {
        $builder = $this->select('enrollments.*, courses.course_name, courses.description, courses.course_code')
                    ->join('courses', 'courses.course_id = enrollments.course_id', 'left')
                    ->where('enrollments.user_id', $user_id);

        if (!empty($statuses)) {
            $builder->whereIn('enrollments.status', $statuses);
        }

        return $builder->orderBy('enrollments.enrollment_date', 'DESC')->findAll();

SELECT `enrollments`.*, `users`.`name`, `users`.`email`, `users`.`year_level`
FROM `enrollments`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '5'
AND `enrollments`.`status` IN ('approved')
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getCourseEnrollments($course_id, array $statuses = ['approved'])
    {
        $builder = $this->select('enrollments.*, users.name, users.email, users.year_level')
                    ->join('users', 'users.id = enrollments.user_id', 'left')
                    ->where('enrollments.course_id', $course_id);

        if (!empty($statuses)) {
            $builder->whereIn('enrollments.status', $statuses);
        }

        return $builder->orderBy('enrollments.enrollment_date', 'DESC')->findAll();

SELECT `enrollments`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`, `courses`.`course_name`, `courses`.`course_code`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`course_id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '3'
AND `enrollments`.`status` = 'pending'
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getPendingByTeacher($teacherId)
    {
        return $this->select('enrollments.*, users.name as student_name, users.email as student_email, courses.course_name, courses.course_code')
                    ->join('courses', 'courses.course_id = enrollments.course_id', 'left')
                    ->join('users', 'users.id = enrollments.user_id', 'left')
                    ->where('courses.teacher_id', $teacherId)
                    ->where('enrollments.status', 'pending')
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();