app/Models/EnrollmentModel.php

    public function getCourseEnrollmentCount($course_id)
    {
        return $this->where('course_id', $course_id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '1'