app/Models/MaterialModel.php

SELECT *
FROM `materials`
WHERE `course_id` = '5'
---
    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)->findAll();