app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `user_id` = '6'
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)->where('is_read', 0)->orderBy('created_at', 'DESC')->limit($limit)->findAll();